{"data":{"markdownRemark":{"html":"<p><em>Phần 3</em></p>\n<h2>Hiểu được tác dụng của các file</h2>\n<p>Nhìn vào thư mục <code>src</code> ta thấy 3 thư mục con</p>\n<ul>\n<li>Components: Đại khái ở đây bạn sẽ viết các đoạn code cho các thành phần của một trang web, ví dụ như header, side bar, nav bar, layout... Các thành phần này sẽ hoạt động như các template, và sẽ áp data vào để thành page hoàn chỉnh.</li>\n<li>Pages: Ở đây sẽ là các code của các trang trong page. Chỗ này sẽ viết các trang như Homepage, About. Các trang post sẽ được sinh tự động từ file Markdown, nên sẽ không đặt ở đây.</li>\n<li>Images: Thư mục này là thư mục chứa ảnh, được load lên bằng cách config Gatsby (nói sau). Các ảnh này là ảnh cố định trên trang web, ví dụ ảnh nền, ảnh trang chủ, ảnh trang profile... Ảnh trong trang blog sẽ không đặt ở đây.</li>\n</ul>\n<p>Mình cũng sẽ tạo thêm một folder nữa là <code>posts</code> ở đây, và nó sẽ có tác dụng chứa các bài blog. Đại khái nó sẽ trông như thế này:\n<img src=\"posts.png\" alt=\"posts\"></p>\n<p>Nhìn ở ngoài folder gốc, bạn có thể thấy các file có tên kiểu <code>gatsby-*.js</code>. Bạn sẽ cần quan tâm đến các file này, đặc biệt là file <code>gatsby-config.js</code> để cài đặt các plugin của Gatsby.</p>\n<p>Có vẻ ổn. Let's continue.</p>\n<h2>Xác định trước structure của trang web.</h2>\n<p>Okay mình sẽ làm blog với các trang kiểu như thế này:</p>\n<pre><code>\\ // Trang chủ, list các bài viết\n\\about // Trang giới thiệu cá nhân\n\\posts\\(post_id) // Một trang blog bất kỳ.\n</code></pre>\n<p>Khá là đơn giản thôi, mình không thích cầu kỳ.</p>\n<p>Đồng thời blog cũng cần 1 trang 404 để hiện lên khi vào một url không tồn tại.</p>\n<p>Nháp xong cấu trúc, chúng ta sẽ bắt đầu build.</p>\n<h2>Chỉnh sửa một chút.</h2>\n<p>Như bạn có thể nhìn thấy trên địa chỉ index đang có một cái ảnh, vài dòng chữ. Rõ ràng chúng ta sẽ không dùng đến cái ảnh. Ta xóa đi file <code>component/image.js</code> và xóa đoạn sử dụng cái ảnh này trong <code>pages/index.js</code></p>\n<pre><code>// pages/index.js\n...\nimport Layout from \"../components/layout\"\nimport SEO from \"../components/seo\"\n\nconst IndexPage = () => (\n  &#x3C;Layout>\n    &#x3C;SEO title=\"Home\" keywords={[`gatsby`, `application`, `react`]} />\n    &#x3C;h1>Hi people&#x3C;/h1>\n    &#x3C;p>Welcome to your new Gatsby site.&#x3C;/p>\n    &#x3C;p>Now go build something great.&#x3C;/p>\n  &#x3C;/Layout>\n)\n\nexport default IndexPage\n</code></pre>\n<p>Cái Header có màu trông khá sida, mình sẽ chọn cho nó không có màu.</p>\n<pre><code>// components/header.js\nconst Header = ({ siteTitle }) => (\n    &#x3C;header\n        style={{\n            background: `none`,\n            marginBottom: `1.45rem`,\n        }}\n    >\n        &#x3C;div\n            style={{\n                margin: `0 auto`,\n                maxWidth: 960,\n                padding: `1.45rem 1.0875rem`,\n            }}\n        >\n            &#x3C;h1 style={{ margin: 0 }}>\n                &#x3C;Link\n                    to=\"/\"\n                    style={{\n                        color: `black`,\n                        textDecoration: `none`,\n                    }}\n                >\n                    {siteTitle}\n ...\n</code></pre>\n<p>Trông có vẻ ổn. Còn một vài cái credit các kiểu ở dưới chân, bạn cũng hãy xóa nốt.</p>\n<pre><code>data => (\n    &#x3C;>\n        &#x3C;Header siteTitle={data.site.siteMetadata.title} />\n        &#x3C;div\n            style={{\n                margin: `0 auto`,\n                maxWidth: 960,\n                padding: `0px 1.0875rem 1.45rem`,\n                paddingTop: 0,\n            }}\n        >\n            &#x3C;main>{children}&#x3C;/main>\n        &#x3C;/div>\n    &#x3C;/>\n)\n</code></pre>\n<p>File <code>component/seo.js</code> chỉnh một số cái header quan trọng trong việc SEO, tạm thời không động đến nó vội.</p>\n<p>Đây sẽ là sản phẩm của bạn sau những chỉnh sửa vừa rồi:\n<img src=\"screen.png\" alt=\"screen\"></p>\n<p>Trang web của bạn trông khá clean rồi, nhưng code thì không. Việc để style inline ngay trong các thẻ jsx sẽ làm cho nó rất xấu và khó debug. Bài tiếp theo mình sẽ hướng dẫn các bạn cách dùng file css module để tách riêng styling và js.</p>","frontmatter":{"date":"2019-04-23T00:00:00.000Z","title":"Tôi đã làm page blog này như thế nào?"},"fields":{"slug":"/blog-guide-3/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}